#pragma once

#include <stdio.h>
#include <windows.h>

#define MAX_CAR_TYPE 24 // 车辆型号最大存储大小
#define MAX_CAR_MANUFACTURER 12 // 车辆厂商最大存储大小
#define MAX_CAR_GRADE 12 // 车辆级别最大存储大小
#define MAX_CAR_SEAT 4 // 车辆座位数最大存储长度
#define MAX_CAR_EMISSION 4 // 车辆排量最大存储长度
#define MAX_CAR_GEARBOX 12 // 车辆变速箱最大存储大小
#define MAX_CAR_COLOUR 12 // 车辆颜色最大存储大小
#define MAX_CAR_PRICE 12 // 车辆价格最大存储长度

typedef struct Car CAR, *PCAR;
struct Car
{
	int id; //编号
	char type[MAX_CAR_TYPE]; //型号
	char manufacturer[MAX_CAR_MANUFACTURER]; //厂商
	char grade[MAX_CAR_GRADE]; //级别
	int seat; //座位数
	float emission; //排量
	char gearbox[MAX_CAR_GEARBOX]; //变速箱
	char colour[MAX_CAR_COLOUR]; //颜色
	float price; //价格
	PCAR front, rear;
};
extern PCAR head, tail;

/***********************************************************************
 * 说明：  从data.dat中读取车辆信息保存为双链表
 ***********************************************************************/
void load_car();

/***********************************************************************
 * 说明：  将所有车辆写入data.dat中
 ***********************************************************************/
void save_car();

/***********************************************************************
 * 说明：  将车辆按照id顺序排列顺序插入链表中
 ***********************************************************************/
void add_list(PCAR car);

/***********************************************************************
 * 说明：  删除指定车辆
 ***********************************************************************/
void del_list(PCAR car);

/***********************************************************************
 * 说明：  获得所有车辆的数量
 * 返回值：车辆的数量
 ***********************************************************************/
int get_all_car_number();

/***********************************************************************
 * 说明：  获得指定编号汽车
 * 返回值：汽车结构体指针
 ***********************************************************************/
PCAR get_car(int car_id);

/***********************************************************************
 * 说明：  获得车辆编号
 ***********************************************************************/
int get_id();
